{
    "es": {
        "about": "Sobre mí",
        "projects": "Proyectos",
        "skills": "Habilidades",
        "technologies": "Tecnologías:",
        "experience": "Experiencia y Educación",
        "contact": "Contacto",
        "contact_info": "Puedes contactarme a través de mi email o en mis redes sociales.",
        "description_1": "¡Hola! Soy Mathias Pena Heredia, un entusiasta del desarrollo de software y estudiante de sexto semestre de Tecnologías de la Información en UTEC. Desde que descubrí el mundo de la programación, supe que quería sumergirme en este fascinante universo y explorar todo lo que tiene para ofrecer.",
        "description_2": "Me encanta enfrentar desafíos y aprender nuevas tecnologías que me ayuden a crear soluciones innovadoras. Trabajo en proyectos de desarrollo full-stack, donde combino mi creatividad con habilidades técnicas para construir aplicaciones efectivas y atractivas. También tengo un interés creciente en machine learning utilizando Python, y disfruto explorando el desarrollo móvil con Kotlin para Android.",
        "description_3": "Soy un firme creyente en la colaboración, así que disfruto trabajar en equipo y compartir ideas con otros. Siempre busco crear un ambiente positivo y motivador.",
        "description_4": "Además de mis habilidades en programación y manejo de bases de datos, estoy emocionado por aprender más sobre Cloud y DevOps. En mi tiempo libre, me gusta experimentar con nuevas herramientas y mantenerme al día con las tendencias de la industria.",
        "description_5": "Hablo español nativo y tengo un nivel avanzado de inglés (C1), lo que me permite comunicarme en diferentes contextos. Estoy emocionado por las oportunidades que el futuro tiene para ofrecer y listo para dejar mi huella en el mundo del software.",
        "project1_description": "Aplicación para gestionar tareas con funcionalidades CRUD.",
        "project2_description": "App para tomar notas de manera sencilla.",
        "education_info": "Actualmente cursando la carrera de Tecnologías de la Información en UTEC.",
        "project1_title": "Gestor de Tareas",
        "project2_title": "Aplicación de Notas",

        "experience.education.title": "Educación",
        "experience.education.utec.title": "UTEC - Tecnologías de la Información",
        "experience.education.status": "Estado:",
        "experience.education.utec.status": "Actualmente cursando el último año",
        "experience.education.location": "Ubicación:",
        "experience.education.utec.location": "Fray Bentos, Uruguay",
        "experience.education.utec.description": "Desarrollo de habilidades en programación, bases de datos, infraestructura, cloud, DevOps, testing, QA, diseño de software y tecnologías web. Proyecto de fin de carrera en curso.",
        "experience.education.utec.dates": "2021 - Presente",
        "experience.education.utu.title": "UTU - Bachillerato en Informática",
        "experience.education.utu.status": "Finalizado",
        "experience.education.utu.location": "Fray Bentos, Uruguay",
        "experience.education.utu.description": "Introducción a la informática. Desarrollo de habilidades en bases de datos, programación, electrónica, redes.",
        "experience.education.utu.dates": "2018 - 2020",

         "skill_java": "Desarrollo backend con Java, APIs, JPA, OOP, programación funcional, estructuras de datos y uso de hilos.",
         "skill_javascript": "Desarrollo de páginas web dinámicas y responsivas, manipulación del DOM y consumo de APIs.",
         "skill_python": "Análisis de datos, limpieza, transformación y entrenamiento de modelos de machine learning.",
         "skill_kotlin": "Desarrollo Android, consumo de APIs, gestión de fragmentos y diseño de interfaces con XML.",
         "skill_html": "Estructuración de contenido web y creación de páginas estáticas y colaborativas.",
         "skill_css": "Diseño y estilización responsiva de páginas web, uso de Flexbox y Grid.",
         "skill_bootstrap": "Diseño rápido y responsivo de páginas web con componentes y sistema de rejillas.",
         "skill_sql": "Consultas SQL, CRUD de tablas, joins, índices y gestión de claves en Oracle y MySQL.",
         "skill_mongodb": "Manejo de MongoDB para operaciones CRUD con colecciones y documentos JSON.",
         "skill_git": "Control de versiones con Git, uso de ramas y convenciones de Git flow."

    },
    "en": {
        "about": "About",
        "projects": "Projects",
        "skills": "Skills",
        "technologies": "Technologies:",
        "experience": "Experience & Education",
        "contact": "Contact",
        "contact_info": "You can contact me via email or social media.",
        "description_1": "Hello! I am Mathias Pena Heredia, a software development enthusiast and a sixth-semester Information Technology student at UTEC. Since discovering the world of programming, I knew I wanted to immerse myself in this fascinating universe and explore everything it has to offer.",
        "description_2": "I love facing challenges and learning new technologies that help me create innovative solutions. I work on full-stack development projects where I combine my creativity with technical skills to build effective and appealing applications. I also have a growing interest in machine learning using Python and enjoy exploring mobile development with Kotlin for Android.",
        "description_3": "I firmly believe in collaboration, so I enjoy working in teams and sharing ideas with others. I always strive to create a positive and motivating environment.",
        "description_4": "In addition to my skills in programming and database management, I am excited to learn more about Cloud and DevOps. In my free time, I enjoy experimenting with new tools and staying updated with industry trends.",
        "description_5": "I am a native Spanish speaker and have an advanced proficiency in English (C1), which allows me to communicate in various contexts. I am excited about the opportunities the future has to offer and ready to make my mark in the software world.",
        "project1_description": "Task manager application with CRUD functionalities.",
        "project2_description": "Simple note-taking app.",
        "education_info": "Currently studying IT at UTEC.",
        "project1_title": "Task Manager",
        "project2_title": "Note App",

        "experience.education.title": "Education",
        "experience.education.utec.title": "UTEC - Information Technology",
        "experience.education.status": "Status:",
        "experience.education.utec.status": "Currently in the final year",
        "experience.education.location": "Location:",
        "experience.education.utec.location": "Fray Bentos, Uruguay",
        "experience.education.utec.description": "Development of skills in programming, databases, infrastructure, cloud, DevOps, testing, QA, software design, and web technologies. Final year project in progress.",
        "experience.education.utec.dates": "2021 - Present",
        "experience.education.utu.title": "UTU - High School in Computer Science",
        "experience.education.utu.status": "Completed",
        "experience.education.utu.location": "Fray Bentos, Uruguay",
        "experience.education.utu.description": "Introduction to computer science. Development of foundational skills in databases, programming, electronics, networks.",
        "experience.education.utu.dates": "2018 - 2020",

        "skill_java": "Backend development with Java, APIs, JPA, OOP, functional programming, data structures, and multithreading.",
        "skill_javascript": "Development of dynamic and responsive web pages, DOM manipulation, and API consumption.",
        "skill_python": "Data analysis, cleaning, transformation, and machine learning model training.",
        "skill_kotlin": "Android development, API consumption, fragment management, and UI design with XML.",
        "skill_html": "Web content structuring and creation of static and collaborative pages.",
        "skill_css": "Responsive web design and styling, with Flexbox and Grid layout systems.",
        "skill_bootstrap": "Fast and responsive web design with components and grid system.",
        "skill_sql": "SQL queries, table CRUD operations, joins, indexes, and key management in Oracle and MySQL.",
        "skill_mongodb": "Handling MongoDB for CRUD operations with collections and JSON documents.",
        "skill_git": "Version control with Git, branch management, and Git flow conventions."

    }
}