{
    "es": {
        "about": "Sobre mí",
        "projects": "Proyectos",
        "skills": "Habilidades",
        "technologies": "Tecnologías:",
        "experience": "Experiencia y Educación",
        "contact": "Contacto",
        "contact_info": "Puedes contactarme a través de mi email o en mis redes sociales.",
        "description_1": "Hola! Soy Mathias Pena, estudiante de séptimo semestre de Licenciatura en Tecnologías de la Información en UTEC y apasionado por el desarrollo de software, data engineering y machine learning. Hace más de cinco años descubrí la programación y desde entonces tengo claro que quiero crear soluciones tecnológicas que marquen la diferencia.",
        "description_2": "Me encanta enfrentar desafíos y aprender nuevas tecnologías que me ayuden a crear soluciones innovadoras. Trabajo en proyectos de desarrollo full-stack, donde combino mi creatividad con habilidades técnicas para construir aplicaciones efectivas y atractivas. También tengo proyectos de data engineering y machine learning en Python, y he desarrollado prototipos móviles en Kotlin para Android.",
        "description_3": "Creo firmemente que las mejores ideas nacen en equipo. Disfruto compartir conocimientos, recibir feedback y colaborar en un ambiente donde cada aporte enriquece el resultado final.",
        "description_4": "Además de las habilidades mencionadas, tengo un fuerte interés por los entornos Cloud y las prácticas DevOps para potenciar mis desarrollos. En el futuro, me gustaría aplicar estos conocimientos en proyectos reales y crecer profesionalmente en esta área.",
        "description_5": "Hablo español nativo y tengo un nivel avanzado de inglés (C1), lo que me permite comunicarme en diferentes contextos. Estoy emocionado por las oportunidades que el futuro tiene para ofrecer y listo para dejar mi huella en el mundo del software y los datos.",
      
        "project1_title": "Portafolio",
        "project1_description": "Diseñé este portafolio desde cero para mostrar mis proyectos, estudios y habilidades, utilizando Bootstrap para el diseño responsivo. Incluye traducciones, CSS organizado en secciones y JavaScript para manejar elementos dinámicos, manteniendo una estructura mayoritariamente estática.",
        "project1_technologies": "HTML, CSS, JavaScript, Bootstrap",

        "project_spring_boot": "Aplicación de tienda online con Spring Boot",
        "project_spring_boot_description": "Aplicación full stack desarrollada con Spring Boot y Vanilla JS, incluyendo un backend y un frontend, con un enfoque en la gestión de productos, usarios, carrito de compras, autenticación y manejo de bases de datos.",
        "project_spring_boot_technologies": "Java, SpringBoot, HTML, CSS, JavaScript",

        "project_bingo_title": "Juego bingo con WebSockets y Tokens",
        "project_bingo_description": "Aplicación web de bingo con frontend y backend integrados, que incluye funcionalidad de login, manejo de tokens para autenticación, conexión con MongoDB para persistencia de datos, y comunicación en tiempo real utilizando WebSockets. Desarrollada para demostrar habilidades full stack en un entorno dinámico y colaborativo.",
        "project_bingo_technologies": "JavaScript, HTML, CSS, Bootstrap, MongoDB, WebSockets, JWT, Java, SpringBoot",

        "project_pftm_title": "Gestor de Eventos y Reclamos Móvil",
        "project_pftm_description": "Aplicación móvil que permite gestionar eventos y reclamos a través de una interfaz intuitiva y adaptada para usuarios con diferentes roles: estudiantes, profesores y analistas. La app incluye un sistema de login seguro con autenticación basada en roles, ofreciendo pantallas personalizadas para cada tipo de usuario. Entre sus funcionalidades, se destacan la creación, visualización y administración de eventos, así como el registro y seguimiento de reclamos. Además, consume APIs externas para manejar datos de manera eficiente y segura, garantizando una experiencia fluida para todos los usuarios.",
        "project_pftm_technologies": "Kotlin, Android, XML, APIs REST",

        "project2_title": "Aplicación de Notas",
        "project2_description": "Desarrollé una aplicación de notas para gestionar tareas pendientes, permitiendo crear, editar, eliminar y marcar tareas como completadas. Ofrece opciones para ordenar y filtrar por fecha, prioridad o estado, y tiene un diseño responsivo compatible con dispositivos móviles y de escritorio. Las tareas se almacenan localmente usando localStorage.",
        "project2_technologies": "JavaScript, HTML, CSS",
       
        "project3_title": "Clustering K-Means de Programas de TV",
        "project3_description": "Implementé un pipeline ETL completo para un conjunto de datos de programas de TV. La solución incluyó carga, limpieza y transformación de datos, corrección de fechas, extracción de características (año, mes) y eliminación de columnas irrelevantes. Las variables categóricas fueron codificadas y los datos normalizados antes de aplicar K-Means. Se evaluó el número óptimo de clusters utilizando el método del codo y métricas de validación (Silhouette, Calinski-Harabasz, Davies-Bouldin). Se utilizó PCA para visualizaciones en 2D y 3D. Este proyecto demuestra habilidades en procesamiento, integración y análisis estructurado de datos.",
        "project3_results": "Agrupamiento claro con gráficos interpretables y análisis de centroides para entender la coherencia de los datos.",
        "project3_technologies": "Python, Pandas, Scikit-learn, Matplotlib, Seaborn.",
       
        "project4_title": "Predicción de Demanda de Compartición de Bicicletas",
        "project4_description": "Desarrollé un pipeline ETL para un conjunto de datos de bicicletas compartidas. El pipeline incluyó limpieza de datos con imputación de valores nulos y tratamiento de outliers. Se realizó ingeniería de características para extraer variables temporales (año, mes, día, día de la semana), seguido de un análisis exploratorio utilizando mapas de calor, histogramas y boxplots para comprender la distribución de las variables y sus relaciones. Se entrenaron dos modelos de regresión (lineal y KNN), evaluados con métricas MSE y R², demostrando habilidades en transformación de datos, análisis y evaluación de modelos.",
        "project4_results": "Clasificación precisa con KNN ajustando el valor de k y predicciones continuas confiables con Regresión Lineal, incluyendo visualizaciones interpretables.",
        "project4_technologies": "Python, Pandas, Scikit-learn, Matplotlib, Seaborn.",
       
        "project5_title": "Predicción de Precios de Viviendas con Regresión Lineal",
        "project5_description": "Desarrollé un pipeline ETL completo para predecir precios de viviendas utilizando el conjunto de datos \"housing.csv\". El proceso incluyó carga de datos, asignación manual de nombres a las columnas y manejo de valores faltantes. Se realizó un análisis exploratorio con boxplots y mapas de calor para identificar outliers y analizar correlaciones. La ingeniería de características incluyó la creación de términos de interacción (RM * LSTAT) y términos polinomiales (RM², LSTAT²) para capturar relaciones no lineales. El conjunto de datos fue estandarizado, dividido en conjuntos de entrenamiento y prueba, y se entrenó un modelo de regresión lineal, evaluado con métricas MSE, RMSE y R², demostrando habilidades en procesamiento, transformación y análisis estructurado de datos.",
        "project5_results": "Predicciones precisas con un modelo ajustado, destacando la relación entre variables mediante gráficos claros y métricas detalladas.",
        "project5_technologies": "Python, Pandas, Scikit-learn, Matplotlib, Seaborn.",
       
        "project6_title": "Clasificación con Regresión Logística",
        "project6_description": "Construí un modelo de aprendizaje supervisado para predecir las calificaciones finales de los estudiantes basado en un conjunto de datos proporcionado por CEIP. El proyecto incluyó un análisis exploratorio, limpieza de datos (eliminación de columnas irrelevantes, imputación de valores faltantes, codificación de variables categóricas), y el entrenamiento de un modelo de regresión logística utilizando scikit-learn. El desempeño del modelo se evaluó mediante métricas de clasificación. El modelo entrenado fue guardado y aplicado a un conjunto de datos de validación, generando predicciones que fueron ajustadas y exportadas para su entrega.",
        "project6_results": "Implementación exitosa con métricas destacables como precisión, recall y F1-score, mostrando resultados claros en matrices de confusión.",
        "project6_technologies": "Python, Pandas, Scikit-learn, Matplotlib, Seaborn.",
       
        "project7_title": "Clasificación con Decision Tree y Random Forest",
        "project7_description": "Este proyecto se centró en clasificar datos relacionados con la hepatitis utilizando modelos de Árbol de Decisión y Bosque Aleatorio. El conjunto de datos fue cargado y se realizó un preprocesamiento que incluyó imputación de valores faltantes para columnas numéricas y categóricas, así como codificación de variables categóricas con LabelEncoder. Ambos modelos (Random Forest y Árbol de Decisión) fueron entrenados y evaluados utilizando matrices de confusión, precisión e informes de clasificación, proporcionando un análisis comparativo de su rendimiento en la predicción de las clases de hepatitis.",
        "project7_results": "Implementación exitosa con precisiones destacables. Las matrices de confusión muestran mejoras en la clasificación al usar Random Forest.",
        "project7_technologies": "Python, Pandas, Scikit-learn, Matplotlib, Seaborn.",
       
        "results": "Resultados:",
       
        "education_info": "Actualmente cursando la carrera de Tecnologías de la Información en UTEC.",
        "experience.education.title": "Educación",
        "experience.education.utec.title": "UTEC - Tecnologías de la Información",
        "experience.education.status": "Estado:",
        "experience.education.utec.status": "Actualmente cursando el último año",
        "experience.education.location": "Ubicación:",
        "experience.education.utec.location": "Fray Bentos, Uruguay",
        "experience.education.utec.description": "Desarrollo de habilidades en programación, bases de datos, infraestructura, cloud, DevOps, testing, QA, diseño de software y tecnologías web. Proyecto de fin de carrera en curso.",
        "experience.education.utec.dates": "2021 - Presente",
        "experience.education.utu.title": "UTU - Bachillerato en Informática",
        "experience.education.utu.status": "Finalizado",
        "experience.education.utu.location": "Fray Bentos, Uruguay",
        "experience.education.utu.description": "Introducción a la informática. Desarrollo de habilidades en bases de datos, programación, electrónica, redes.",
        "experience.education.utu.dates": "2018 - 2020",
       
        "skill_java": "Desarrollo backend con Java, APIs, JPA, OOP, programación funcional, estructuras de datos y uso de hilos.",
        "skill_springboot":"Desarrollo de aplicaciones backend con Spring Boot, implementación de APIs REST, autenticación con JWT, manejo de bases de datos con JPA y PostgreSQL, validaciones, manejo de excepciones y estructuración en capas.",
        "skill_javascript": "Desarrollo de páginas web dinámicas y responsivas, manipulación del DOM y consumo de APIs.",
        "skill_python": "Análisis de datos, limpieza, transformación y entrenamiento de modelos de machine learning.",
        "skill_kotlin": "Desarrollo Android, consumo de APIs, gestión de fragmentos y diseño de interfaces con XML.",
        "skill_html": "Estructuración de contenido web y creación de páginas estáticas y colaborativas.",
        "skill_css": "Diseño y estilización responsiva de páginas web, uso de Flexbox y Grid.",
        "skill_bootstrap": "Diseño rápido y responsivo de páginas web con componentes y sistema de rejillas.",
        "skill_sql": "Consultas SQL, CRUD de tablas, joins, índices y gestión de claves en Oracle y MySQL.",
        "skill_mongodb": "Manejo de MongoDB para operaciones CRUD con colecciones y documentos JSON.",
        "skill_git": "Control de versiones con Git, uso de ramas y convenciones de Git flow.",
       
        "faq.question1": "¿Qué tecnologías se utilizaron para construir este portafolio?",
        "faq.answer1": "Este portafolio se desarrolló con HTML, CSS y JavaScript para la estructura, el estilo y la interacción. Además, se usó Bootstrap para facilitar el diseño responsive y mejorar la accesibilidad en diferentes dispositivos",
        "faq.question2": "¿Puedo acceder al código de este portafolio?",
        "faq.answer2": "Sí, el código fuente está disponible en la sección de Proyectos, donde puedes revisarlo y explorar cómo está construido.",
        "faq.question3": "¿En qué te basaste para diseñar este portafolio?",
        "faq.answer3": "Este portafolio fue diseñado completamente desde cero, inspirado en estilos específicos para distintas secciones. Me enfoqué en crear un diseño simple, funcional y estético, inspirado en las mejores prácticas de presentación profesional.",
        "faq.question4": "¿Puedo usar este portafolio como plantilla?",
        "faq.answer4": "Sí, puedes usarlo como referencia o plantilla. Solo te pido que me avises si decides utilizarlo, ¡así puedo ver cómo lo adaptaste!"
    },
    "en": {
        "about": "About",
        "projects": "Projects",
        "skills": "Skills",
        "technologies": "Technologies:",
        "experience": "Experience & Education",
        "contact": "Contact",
        "contact_info": "You can contact me via email or social media.",
        "description_1": "Hi! I'm Mathias Pena, a seventh-semester Information Technology student at UTEC, passionate about software development, data engineering, and machine learning. I discovered programming over five years ago, and since then, I’ve known I want to create tech solutions that make a difference.",
        "description_2": "I love tackling challenges and learning new technologies that help me build innovative solutions. I work on full-stack development projects where I combine creativity with technical skills to build effective and engaging applications. I also have data engineering and machine learning projects in Python, and I’ve developed mobile prototypes in Kotlin for Android.",
        "description_3": "I firmly believe the best ideas are born from teamwork. I enjoy sharing knowledge, receiving feedback, and collaborating in environments where every contribution enriches the final result.",
        "description_4": "Besides the skills mentioned, I have a strong interest in Cloud environments and DevOps practices to enhance my development process. In the future, I’d love to apply this knowledge in real-world projects and grow professionally in this field.",
        "description_5": "I’m a native Spanish speaker and have an advanced level of English (C1), which allows me to communicate in various contexts. I'm excited about the opportunities the future holds and ready to make my mark in the world of software and data.",
        "education_info": "Currently studying IT at UTEC.",
       
        "project1_title": "Portfolio",
        "project1_description": "I designed this portfolio from scratch to showcase my projects, studies, and skills, using Bootstrap for the responsive design. It includes translations, CSS organized into sections, and JavaScript to handle dynamic elements, while keeping the structure mostly static.",
        "project1_technologies": "HTML, CSS, JavaScript, Bootstrap",

        "project_spring_boot": "Online store application with Spring Boot",
        "project_spring_boot_description": "Full stack application developed with Spring Boot and Vanilla JS, including a backend and a frontend, focusing on product management, users, shopping cart, authentication, and database handling.",
        "project_spring_boot_technologies": "Java, Spring Boot, HTML, CSS, JavaScript",

        "project_bingo_title": "Bingo Game with WebSockets and Tokens",
        "project_bingo_description": "Web application for playing bingo with integrated frontend and backend. Features include login functionality, token-based authentication, MongoDB connection for data persistence, and real-time communication using WebSockets. Developed to showcase full-stack skills in a dynamic and collaborative environment.",
        "project_bingo_technologies": "JavaScript, HTML, CSS, Bootstrap, MongoDB, WebSockets, JWT, Java, Spring Boot",

        "project_pftm_title": "Mobile Events and Claims Manager",
        "project_pftm_description": "A mobile application that enables the management of events and claims through an intuitive interface tailored for users with different roles: students, teachers, and analysts. The app includes a secure login system with role-based authentication, offering personalized screens for each type of user. Key features include the creation, viewing, and management of events, as well as the registration and tracking of claims. Additionally, it consumes external APIs to handle data efficiently and securely, ensuring a seamless experience for all users.",
        "project_pftm_technologies": "Kotlin, Android, XML, REST APIs",

        "project2_title": "Notes Application",
        "project2_description": "I developed a note-taking app for managing pending tasks, allowing users to create, edit, delete, and mark tasks as completed. It offers options to sort and filter by date, priority, or status, with a responsive design compatible with both mobile and desktop devices. Tasks are stored locally using localStorage.",
        "project2_technologies": "JavaScript, HTML, CSS",
       
        "project3_title": "K-Means Clustering of TV Shows",
        "project3_description": "Implemented a full ETL pipeline for a TV shows dataset. The solution involved data loading, cleaning, and transformation, including date correction, feature extraction (year, month), and removal of irrelevant columns. Categorical variables were encoded, and data was normalized before applying K-Means. The optimal number of clusters was evaluated using the elbow method and validation metrics (Silhouette, Calinski-Harabasz, Davies-Bouldin). PCA was used for 2D and 3D visualizations. This project showcases skills in data processing, integration, and structured analysis.",
        "project3_results": "Clear clustering with interpretable graphs and centroid analysis to understand data coherence.",
        "project3_technologies": "Python, Pandas, Scikit-learn, Matplotlib, Seaborn.",
       
        "project4_title": "Bike Sharing Demand Prediction",
        "project4_description": "Developed an ETL pipeline for a bike-sharing dataset. The pipeline involved data cleaning with null value imputation and outlier treatment. Feature engineering was performed to extract temporal variables (year, month, day, weekday), followed by exploratory analysis using heatmaps, histograms, and boxplots to understand variable distributions and relationships. Two regression models (linear and KNN) were trained and evaluated using MSE and R² metrics, demonstrating skills in data transformation, analysis, and model evaluation.",
        "project4_results": "Accurate classification with KNN by adjusting the value of k and reliable continuous predictions with Linear Regression, including interpretable visualizations.",
        "project4_technologies": "Python, Pandas, Scikit-learn, Matplotlib, Seaborn.",
       
        "project5_title": "Housing Price Prediction with Linear Regression",
        "project5_description": "Developed a complete ETL pipeline for predicting housing prices using the \"housing.csv\" dataset. The process included data loading, manual column naming, and handling missing values. Exploratory analysis was conducted using boxplots and heatmaps to identify outliers and analyze correlations. Feature engineering included creating interaction terms (RM * LSTAT) and polynomial terms (RM², LSTAT²) to capture non-linear relationships. The dataset was standardized, split into training and test sets, and a linear regression model was trained and evaluated using MSE, RMSE, and R² metrics, demonstrating skills in data processing, transformation, and structured analysis.",
        "project5_results": "Accurate predictions with a well-fitted model, highlighting the relationship between variables through clear graphs and detailed metrics.",
        "project5_technologies": "Python, Pandas, Scikit-learn, Matplotlib, Seaborn.",
       
        "project6_title": "Classification with Logistic Regression",
        "project6_description": "Built a supervised learning model to predict student final grades based on a dataset provided by CEIP. The project involved exploratory analysis, data cleaning (removing irrelevant columns, imputing missing values, encoding categorical variables), and training a logistic regression model using scikit-learn. Model performance was evaluated using classification metrics. The trained model was saved and applied to a validation dataset, generating predictions that were adjusted and exported for submission.",
        "project6_results": "Successful implementation with outstanding metrics such as precision, recall, and F1-score, showing clear results in confusion matrices.",
        "project6_technologies": "Python, Pandas, Scikit-learn, Matplotlib, Seaborn.",
       
        "project7_title": "Classification with Decision Tree and Random Forest",
        "project7_description": "This project focused on classifying hepatitis-related data using Decision Tree and Random Forest models. The dataset was loaded, and preprocessing was performed, including imputation of missing values for numerical and categorical columns and encoding categorical variables with LabelEncoder. Both Random Forest and Decision Tree models were trained and evaluated using confusion matrices, accuracy, and classification reports, providing a comparative analysis of their performance in predicting hepatitis classes.",
        "project7_results": "Successful implementation with remarkable accuracies. Confusion matrices show improved classification when using Random Forest.",
        "project7_technologies": "Python, Pandas, Scikit-learn, Matplotlib, Seaborn.",
       
        "results": "Results:",

        "experience.education.title": "Education",
        "experience.education.utec.title": "UTEC - Information Technology",
        "experience.education.status": "Status:",
        "experience.education.utec.status": "Currently in the final year",
        "experience.education.location": "Location:",
        "experience.education.utec.location": "Fray Bentos, Uruguay",
        "experience.education.utec.description": "Development of skills in programming, databases, infrastructure, cloud, DevOps, testing, QA, software design, and web technologies. Final year project in progress.",
        "experience.education.utec.dates": "2021 - Present",
        "experience.education.utu.title": "UTU - High School in Computer Science",
        "experience.education.utu.status": "Completed",
        "experience.education.utu.location": "Fray Bentos, Uruguay",
        "experience.education.utu.description": "Introduction to computer science. Development of foundational skills in databases, programming, electronics, networks.",
        "experience.education.utu.dates": "2018 - 2020",
       
        "skill_java": "Backend development with Java, APIs, JPA, OOP, functional programming, data structures, and multithreading.",
        "skill_springboot":"Backend application development with Spring Boot, implementation of REST APIs, authentication with JWT, database management with JPA and PostgreSQL, validations, exception handling, and layered architecture.",
        "skill_javascript": "Development of dynamic and responsive web pages, DOM manipulation, and API consumption.",
        "skill_python": "Data analysis, cleaning, transformation, and machine learning model training.",
        "skill_kotlin": "Android development, API consumption, fragment management, and UI design with XML.",
        "skill_html": "Web content structuring and creation of static and collaborative pages.",
        "skill_css": "Responsive web design and styling, with Flexbox and Grid layout systems.",
        "skill_bootstrap": "Fast and responsive web design with components and grid system.",
        "skill_sql": "SQL queries, table CRUD operations, joins, indexes, and key management in Oracle and MySQL.",
        "skill_mongodb": "Handling MongoDB for CRUD operations with collections and JSON documents.",
        "skill_git": "Version control with Git, branch management, and Git flow conventions.",
       
        "faq.question1": "What technologies were used to build this portfolio?",
        "faq.answer1": "This portfolio was developed using HTML, CSS, and JavaScript for structure, styling, and interaction. Additionally, Bootstrap was used to facilitate responsive design and improve accessibility across different devices.",
        "faq.question2": "Can I access the code for this portfolio?",
        "faq.answer2": "Yes, the source code is available in the Projects section, where you can review it and explore how it's built.",
        "faq.question3": "What inspired you in designing this portfolio?",
        "faq.answer3": "This portfolio was designed completely from scratch, inspired by specific styles for various sections. I focused on creating a simple, functional, and aesthetic design, drawing from best practices in professional presentation.",
        "faq.question4": "Can I use this portfolio as a template?",
        "faq.answer4": "Yes, you can use it as a reference or template. I only ask that you let me know if you decide to use it so I can see how you adapted it!"
    }
}